[
  {
    "path": "posts/2020-09-07-imgenes-de-fractales-en-gran-formato-con-r/",
    "title": "Imágenes de fractales en gran formato con R",
    "description": "Aproveché unos días de mis vacaciones para preparar algunas gráficas en R, que quería hacer desde hace tiempo para adornar mi estudio. Se trata de fractales y atractores extraños, pero quería hacerlos de forma de poder imprimirlos en formato grande, como afiches.",
    "author": [
      {
        "name": "José R Sosa",
        "url": "https://example.com/josersosa"
      }
    ],
    "date": "2020-09-07",
    "categories": [
      "R",
      "Chaos and Fractals",
      "Computer Graphics",
      "Data Science"
    ],
    "contents": "\n\nContents\nGráficas en gran formato con R\nAlgoritmos de construcción\nEstructuras de datos\nProcesamiento optimización\nDimensiones y formato de la imagen\nAlising\nLayout de impresión\n\n\nAproveché unos días de mis vacaciones para preparar algunas gráficas en R, que quería hacer desde hace tiempo para adornar mi estudio. Se trata de fractales y atractores extraños, pero quería hacerlos de forma de poder imprimirlos en formato grande, como afiches. La idea era no tener que escalar las imágenes para imprimirlas en formatos grandes, sino que en vez de eso, estuvieran elaboradas pixel a pixel para estos formatos como el A1 (23.4 x 33.1 in) a 300dpi o el A2 (16.5 x 23.4 in) a 600dpi.\nHe aquí algunos resultados:\nConjunto de Mandelbrot\nAtractor de Lorenz\nAtractor de Clifford\n\n\n\nBreve reseña\nBreve reseña\nBreve reseña\nImagen de alta resolución\nImagen de alta resolución\nImagen de alta resolución\nCódigo fuente\nCódigo fuente\nCódigo fuente\nPongo a la disposición estas imágenes en alta resolución para su libre descarga, bajo licencia Creative Commons, así como los enlaces a los repositorios de código fuente para regenerarlas o modificarlas. En un próximo post estaré publicando un tutorial explicando como construir este tipo de gráficas con R, así como algunas reseñas donde expongo, desde mi punto de vista, del por qué son de tanto interés.\nGráficas en gran formato con R\nEl reto de crear imágenes de fractales o atractores extraños de gran formato implica resolver varios asuntos, entre ellos están:\nAlgoritmos de construcción.\nEstructuras de datos.\nProcesamiento y optimización.\nDimensiones y formato de la imagen.\nEl problema del Alising.\nLayout de impresión.\nAlgoritmos de construcción\nLa mayoría de los fractales o atractores extraños se construyen a partir de la definición y simulación de alguna dinámica, por ejemplo \\[\nX_{n+1}=F(X_n)\n\\] con cual, se construyen secuencias de valores para el vector X , a partir de un valor inicial o condición inicial para dicho sistema, para esto y se pueden utilizar varias estrategias:\nDiagramas de fase: consiste en la proyección de las trayectorias construidas con las variables de estado juntas en el espacio n-dimensional hacia un plano 2D.\nEscala de valores de convergencia, que consiste en recorrer una sección del espacio de posibles valores iniciales y representar en una escala de colores a los que llevan a la dinámica a converger, tomando colores según el valor de convergencia.\nTiempo de escape, consiste en en recorrer una sección del espacio de posibles condiciones iniciales y seleccionando aquellas que producen la divergencia de la dinámica, pero tomando como valor de referencia para la selección del color, la cantidad de iteraciones que requirieron para alcanzar cierto umbral, como una especie de medida de velocidad de escape.\nCualquier otro método creativo que se nos ocurra.\nEstructuras de datos\nLas estructuras de datos para construir estas gráficas son simples, el verdadero problema es contar con la memoria RAM suficiente para almacenar series de 20 millones de registros para cada una de las variables del vector de estados, o matrices en el orden de 10.000x10.000, es decir 100 millones de puntos o más\nProcesamiento optimización\nPara lograr un algoritmo capaz de construir nuestras imágenes debemos pensar en la eficiencia, en la medida de lo posible ejecutar procesos de calculo vectoriales o recurrir a sub-procesos en C/C++ con la ayuda del paquete rcpp.\nDimensiones y formato de la imagen\nCómo comentamos al comienzo, la idea principal es generar imágenes que no requieran ser escaladas o reducidas al momento de la impresión, es decir que tengan las dimensiones exactas en las cuales se verán. Recordemos que si una imagen es reducida, pierde información visual, mientras que si es agrandada, esta se pixelará. Por esta razón, primero que nada debemos decidir el tamaño impreso de nuestra gráfica.\nTabla de tamaños estándar de papel\nSize\nWidth x Height (mm)\nWidth x Height (in)\nA0\n841 x 1189 mm\n33.1 x 46.8 in\nA1\n594 x 841 mm\n23.4 x 33.1 in\nA2\n420 x 594 mm\n16.5 x 23.4 in\nA3\n297 x 420 mm\n11.7 x 16.5 in\nA4\n210 x 297 mm\n8.3 x 11.7 in\nA5\n148 x 210 mm\n5.8 x 8.3 in\nA6\n105 x 148 mm\n4.1 5.8 in\nA7\n74 x 105 mm\n2.9 x 4.1 in\nA8\n52 x 74 mm\n2.0 x 2.9 in\nA9\n37 x 52 mm\n1.5 x 2.0 in\nA10\n26 x 37 mm\n1.0 x 1.5 in\nEn R es posible graficar sobre dispositivos de despliegue distintos a la pantalla, en vez de esto podemos crear imágenes directamente en archivos con diversos formatos con funciones como png(), jpg(), tiff() o pdf(). Entre sus parámetros es posible especificar el tamaño del gráfico en diferentes unidades de medida (“cm”, “mm” o “in”), así como la resolución en “dpi” (puntos por pulgada). En relación con el formato, la recomendación es usar el PNG, dado que JPEG optimiza la imagen reduciendo su tamaño pero perdiendo calidad. Por ejemplo para generar una imagen de tamaño A2 a 600dpi y en formato PNG, el código sería de la siguiente manera:\npng(filename=\"graphic.png\", units=\"in\", width=23.4, height=16.5, res=600)\n    codigo de generación de la imagen aqui...\ndev.off()\nLe estamos indicando al dispositivo de salida que la grafica tendrá un tamaño de 23.4x16.5 pulgadas (A2) a una resolución de 600dpi. Esta misma imagen también se podría imprimir en un papel tamaño A1 pero si se reduce la resolución a 300dpi.\nAlising\nEn general, durante el proceso de generación del gráfico, cada pixel se calcula de manera exacta, sin embargo esto no es conveniente para los efectos estéticos, debido a efecto de alising, especialmente cuando lo que se despliega en la imagen son trayectorias o líneas. El Alising es el ese tipo de efecto de escalera que tienen la líneas cuando se dibujan de forma oblicua.\nPara reducir este problema se utiliza una técnica llamada anti-alising que consisten en dibujar los pixeles con cierto grado de transparencia dependiendo que tan cercanos están de la línea imaginaria central que podemos trazar en cualquier línea gráfica, haciendo que el trazo parezca suave en lugar de escalonado. Para esto se requiere acceder a las primitivas de despliegue gráfico del sistema operativo. No todos los sistemas soportan este tipo de primitivas, uno de ellos es GNOME con la librería de gráficos vectoriales llamada cairo. Por suerte, es posible incorporar su uso desde R a través del paquete “cairo”, y luego incluyendo el parámetro “type” en la función png():\ninstall.packages(\"cairo\")\nlibrary(cairo)\npng(filename=\"graphic.png\", units=\"in\", width=23.4, height=16.5, res=600, type=\"cairo-png\")\n    codigo de generación de la imagen aqui...\ndev.off()\nLayout de impresión\nEn muchos centros de impresión tienen el mismo precio, imprimir un pliego de tamaño A2 que uno de tamaño A0. En este caso es mucho más inteligente aprovechar todo el pliego A0, en el cual caben varias combinaciones (dos hojas A1, un A1 y dos A2 o cuatro A2). Para esto basta con ubicar nuestras imágenes en los tamaños y posiciones correctas.\n\nEsta tarea suele ser sencilla, el tema es que si nuestras imágenes son muy pesadas podríamos tener problemas para cargar varias de ellas en un software de dibujo cualquiera. Mi recomendación es utilizar herramientas de transformación de gráficos raster en línea de comandos, estoy hablando específicamente de imagemagick, software libre que podemos instalar en cualquier sistema operativo. Esta herramienta incluye un comando llamado convert que tiene entre su parámetros el append y rotate, que podemos usar para disponer adecuadamente nuestras imágenes en un formato A0.\nPor ejemplo si disponemos de 4 archivos de imágenes tamaño A2: clifford1.png y clifford2.png con orientación vertical, y dos imágenes lorenz1.png y mandelbrot1.png con orientación apaisada,\npodríamos usar el comando convert, para generar a partir de estos 4 archivos, uno solo en formato A0:\nconvert.exe +append clifford1.png Clifford2.png image01.png\nconvert.exe -append Mandelbrot1.png lorenz1.png image02.png\nconvert.exe -rotate 90 image02.png image03.png\nconvert.exe -append image01.png image03.png image04.png\n\n\n\n",
    "preview": "posts/2020-09-07-imgenes-de-fractales-en-gran-formato-con-r/../../images/fractales_galery.png",
    "last_modified": "2021-03-14T20:03:27+00:00",
    "input_file": {},
    "preview_width": 627,
    "preview_height": 318
  },
  {
    "path": "posts/2020-09-07-el-arte-del-movimiento-catico/",
    "title": "El arte del movimiento caótico",
    "description": "Un factor común de la mayoría de los fractales, es su poder de atraernos, de casi hipnotizarnos por su particular belleza, tal como si fueran verdaderas obras de arte. Los atractores de Clifford son un ejemplo del arte que puede representar el movimiento de los sistemas caóticos. De hecho, he comenzado preparar varios de estos gráficos en alta resolución, para compartirlos con ustedes y puedan ser impresos como posters si lo desean.",
    "author": [
      {
        "name": "José R Sosa",
        "url": "https://example.com/josersosa"
      }
    ],
    "date": "2020-03-19",
    "categories": [
      "Chaos and Fractals",
      "Computer Graphics"
    ],
    "contents": "\nUn factor común de la mayoría de los fractales, es su poder de atraernos, de casi hipnotizarnos por su particular belleza, tal como si fueran verdaderas obras de arte. Los atractores de Clifford son un ejemplo del arte que puede representar el movimiento de los sistemas caóticos.\nPéndulo Caótico\nRecordando el efecto mariposa, el péndulo doble es uno de los sistemas caóticos más simples. Si se lanza, dando posiciones iniciales ligeramente diferentes cada vez, se obtienen trayectorias completamente distintas.\nAtractores de Clifford\nOtras dinámicas inspiradas en este tipo de sistemas son las que generan los atractores de Clifford: \\[\nx_{n+1} = sin (a~y_n ) + c~cos (a~x_n ) \\\\\ny_{n+1} = sin (b~x_n ) + d~cos (b~y_n )\n\\]\nCon solo variar los parámetros a,b,c, y d es posible obtener una infinidad de atractores de increíble rareza y particular belleza, casi cómo si fueran verdaderas obras de arte. Haciendo algunas simulaciones en las que dibujamos las trayectorias con un poco de transparencia, es fácil notar que para ciertos parámetros,\nAtractor de Clifford\n\nse obtienen estructuras en las que las trayectorias tienden a cubrir todo el espacio de posibilidades, sin embargo la distribución no es uniforme.\nAlgunas trayectorias son mas probables que otras. Lo que se puede observar por la intensidad de esos trazos, gracias a ellas\nse generan imágenes que aparentan tener volumen tridimensional, a pesar de estar definidas y construidas y en 2 dimensiones.\nClifford Alan Pickover es un científico que dedicó gran parte de su vida a la divulgación de la ciencia, la visualización científica , al arte computacional y a las matemáticas recreativas. En sus propias palabras, planteó que “los datos … proliferan a un ritmo increíble, si los humanos intentan leer dichos datos en forma de números y letras, tomarán la información al ritmo de un caracol. Sin embargo, si la información se presenta gráficamente, los analistas humanos pueden asimilarla y obtener información mucho más rápido”1. En muchos sentidos, sus trabajos funcionaron para impulsar el “el arte y la ciencia de hacer visibles los trabajos invisibles de la naturaleza”2.\n\n\n\n",
    "preview": "posts/2020-09-07-el-arte-del-movimiento-catico/../../images/Clifford_peq_yelow02.png",
    "last_modified": "2021-03-14T17:00:32+00:00",
    "input_file": {},
    "preview_width": 595,
    "preview_height": 419
  },
  {
    "path": "posts/2020-09-07-el-infinito-detalle-del-conjunto-de-mandelbrot/",
    "title": "El infinito detalle del conjunto de Mandelbrot",
    "description": "La convergencia de los sistemas dinámicos complejos es un problema recurrente en muchos campos, su predictibilidad  en algunos casos pudiera estar involucrada con los conceptos de la geometría fractal y la teoría del caos. Escribí una breve reseña sobre uno de los fractales más conocidos vinculados con este tema: el conjunto de Mandelbrot.",
    "author": [
      {
        "name": "José R Sosa",
        "url": "https://example.com/josersosa"
      }
    ],
    "date": "2020-02-28",
    "categories": [
      "Chaos and Fractals",
      "Computer Graphics",
      "Data Science"
    ],
    "contents": "\n¿Cuánto mide la costa de Gran Bretaña? Parece una pregunta simple, pero su respuesta sorprendió a Benoît B. Mandelbrot: depende de cuán cerca se mire, “aquí hay una pregunta, un elemento básico de la geometría de la escuela primaria que, si lo piensas, es imposible” - dijo - “la longitud de la costa, en cierto sentido, es infinita”1.\nVeámoslo de la siguiente forma, pareciera sencillo medir la longitud en un mapa, pero si nos acercamos a ver con mayor detalle, descubriremos que no tomamos en cuenta muchos dobleces y cuencas, es decir que en realidad la distancia es un poco mayor de lo que creíamos. Pues bien, este efecto se repetirá siempre que veamos el mapa con mayor detalle, y es precisamente lo que ocurre con muchos objetos de la naturaleza, como las montañas, las nubes y en las matemáticas, cómo lo descubrió Mandelbrot con el conjunto que ahora lleva su nombre:\n\nEste objeto formado por todos los valores de condiciones iniciales para los cuales una determinada dinámica converge, nos muestra el infinito detalle que separa los valores que nos llevan a la convergencia, de aquellos que la hacen divergir: \\[\nz_{n+1}=z_n^2+c\n\\] Sorprende cómo una dinámica tan simple pueda generar una imagen tan fascinante, que muestra propiedades tan extrañas como la auto-similitud, vemos como las mismas formas se repiten y reaparecen a diferentes escalas.\nLa aparente contradicción entre la longitud del conjunto y su infinito detalle se resolvió con una sorprendente idea: este objeto no está en 2 dimensiones, evidentemente tampoco en 3, sino que pertenece a algún punto entre la 2da y 3ra dimensión, es decir, que pertenece a una dimensión fraccionaria o dimensión fractal, y de aquí, el por qué objetos como este adoptaron el nombre de Fractales. Piénsenlo bien, un perímetro o distancia es una medida unidimensional, calculada sobre un mapa (bidimensional), sin embargo, este objeto tiene un poco más de dos dimensiones por eso es imposible calcular su perímetro de manera exacta.\n¿Cuando y por qué algunas dinámicas matemáticas convergen mientras otras divergen?, o más aún ¿porque algunas dinámicas convergen bajo ciertas condiciones iniciales y divergen en otras? Como ven, la respuestas pueden llegar a ser más complejas de lo que pensábamos. Cuando estamos cerca del borde del conjunto, un punto podría converger mientras que otro infinitesimalmente cercano podría no hacerlo, en esta región se comporta como un sistema caótico.\nEstas son preguntas importantes cuando, por ejemplo, trabajamos en el entrenamiento de modelos de inteligencia artificial, en los cuales solemos usar algoritmos de entrenamiento o dinámicas como el descenso del gradiente. Esto respondería cuestiones como el por qué algunos sistemas tienen la capacidad de “aprender” mientras que otros no. O visto de otra forma, cómo diseñar sistemas de aprendizaje automático cuya dinámica de entrenamiento nos garantice la convergencia, es decir, aprender.\n\n\n",
    "preview": "posts/2020-09-07-el-infinito-detalle-del-conjunto-de-mandelbrot/../../images/Mandelbrot_red_peq.png",
    "last_modified": "2020-09-13T03:53:16+00:00",
    "input_file": {},
    "preview_width": 595,
    "preview_height": 419
  },
  {
    "path": "posts/2020-09-07-atractor-de-lorenz-y-el-efecto-mariposa/",
    "title": "Atractor de Lorenz y \"el efecto mariposa\"",
    "description": "El aparente desorden o aleatoriedad de los sistemas caóticos, es en realidad orden, tan exacto y matemático como impredecible e inexplicable. Escribí una breve reseña de una historia que vi cuando estudiaba en la universidad, sobre una de las características más interesantes de la teoría del caos: \"el efecto mariposa\".",
    "author": [
      {
        "name": "José R Sosa",
        "url": "https://example.com/josersosa"
      }
    ],
    "date": "2020-02-26",
    "categories": [
      "Chaos and Fractals",
      "Computer Graphics",
      "Data Science",
      "Simulation"
    ],
    "contents": "\nEn 1963 el matemático y meteorólogo Eduard N. Lorenz estaba experimentando con unas ecuaciones diferenciales ordinarias en un intento por simular una versión simplificada de una dinámica del clima. \\[\n\\begin{aligned}\n\\dot{x} & = \\sigma(y-x) \\\\\n\\dot{y} & = x(\\rho - z) - y \\\\\n\\dot{z} & = xy -\\beta z\n\\end{aligned}\n\\] En medio de la simulación, cuyos resultados se tenían que imprimir porque no se podían guardar en disco por esa época, se fue la luz. Una vez reestablecido el sistema, decidió continuar con la simulación pero no comenzando desde el principio, sino que tomó las condiciones iniciales en un punto intermedio de la secuencia que ya había creado. De esa forma ahorraría papel, tiempo y podría verificar que el sistema evolucionaría de la misma manera que lo había hecho antes. Sin embargo esto que parecía obvio, no ocurrió. Al cabo de un tiempo las secuencias original y la nueva comenzaron a separarse, y mucho. Se hicieron pruebas para intentar descubrir donde estaba el error, pero el hecho es que tanto el primer cálculo como el segundo seguían perfectamente las ecuaciones. El análisis gráfico mostró lo que realmente estaba ocurriendo:\n\nSin importar las condiciones iniciales que se escojan el resultado es el mismo\nLas tres variables, juntas en un gráfico de tres dimensiones, siempre tenderán a formar la figura de un atractor extraño de dos discos en 3D, que ahora conocemos como el atractor de Lorenz,\nSin embargo, estas trayectorias no son cíclicas, ya que estos caminos nunca se repiten.\nPor muy parecidas que sean dos trayectorias, estas tenderán a separarse radicalmente tarde o temprano, de hecho\nbasta una mínima diferencia “infinitesimal” entre lo dos caminos para que esto ocurra, que fue justamente lo que pasó en el experimento original, donde la variación estuvo en el orden de los decimales que no se pudieron imprimir.\nInspirado en la forma de este atractor extraño, Lorenz le dio nombre al famoso postulado de la teoría del caos: \"El efecto mariposa que dice que hasta el aleteo de una mariposa podría desencadenar eventos catastróficos en otra arte del mundo, como una poderosa tormenta.\n\nEsta imagen muestra como las trayectorias forman una patrón pero sin llegar a tocarse. Las líneas tienen el ancho de un pixel con anti-alising para maximizar el detalle en la versión impresa.\n\nEn esta imagen de detalle del atractor se observan trayectorias que parecen venir juntas y comienzan a separarse, algunas continúan en el mismo disco y otras pasan al otro.\nEs impresionante ver como esta complejidad pueda surgir de ecuaciones tan simples. Nos hace pensar que muchos fenómenos de la naturaleza aparentemente aleatorios pudieran ser caóticos, es decir, regidos por reglas matemáticas, y de ser así, sería más impactante aún, tener que aceptar que aunque conociéramos las ecuaciones que rigen a la naturaleza o el universo, no podríamos usarlas para predecir el futuro, ya que tendríamos que poder medir con infinita precisión el valor de las variables involucradas.\nEl aparente desorden o aleatoriedad de los sistemas caóticos, es en realidad orden, tan exacto y matemático como impredecible e inexplicable.\n\n\n",
    "preview": "posts/2020-09-07-atractor-de-lorenz-y-el-efecto-mariposa/../../images/lorenz_yelow11-10mm_peq.png",
    "last_modified": "2020-09-13T03:52:31+00:00",
    "input_file": {},
    "preview_width": 594,
    "preview_height": 420
  }
]
