[
  {
    "path": "gabyprojects/2021-06-13-construccion-de-un-avion-de-madera-de-balsa/",
    "title": "Construcción de un avión de madera de balsa",
    "description": "Hace un par de meses, un día que llegaba del trabajo, Gabriela me  pidió un avión rojo, \"como el de Pocoyo\". No fue sino hasta unos días  después que entendí lo que quería y le propuse construirlo nosotros  mismos. A pesar de sus 3 años, Gaby de concentra y enfoca bastante en  actividades que hacemos juntos, la única fase en la que no podría  participar era en la de cortar la madera.",
    "author": [
      {
        "name": "José R Sosa",
        "url": "https://josersosa.github.io/personalweb/"
      }
    ],
    "date": "2013-11-15",
    "categories": [
      "Madera"
    ],
    "contents": "\n\nContents\nBuscando los modelos\nComprando los Materiales\nConstruyendo el avión\nJugando con el avión.\n\nJamas me había tenido la oportunidad de trabajar con madera de balsa, aunque desde hace tiempo tenía la curiosidad de hacerlo, así que decidí construir su “avión rojo”.\nBuscando los modelos\nEl primer paso fue buscar el modelo que me serviría de guiá en el proceso. No fue difícil encontrar una gran cantidad de modelos en Internet. En el sitio www.e-aeromodelismo.com.ar encontré mucha variedad de modelos de aviones para madera balsa. De todos los que pude revisar me quede con el modelo llamado Escolar por parecerse un poco al avión deseado.\n\nComprando los Materiales\nEl siguiente paso fue comprar una lamina de madera balsa de 4mm que me costo 65Bs, después me dí cuenta que este ancho era demasiado. Esto afectó especialmente el proceso de doblar las alas para darle la curvatura requerida en el punto de contacto con el cuerpo del avión. Otro material fue la pintura roja no toxica, como la utilizada en preescolar, para que pueda ser manipulada por la niña sin problemas. Por ultimo, una hojilla exacto para cortar la madera, un clip y un cordel que luego veremos su utilidad.\nConstruyendo el avión\nPara aprovechar la madera, tuve que escalar la imagen e imprimirla en dos hojas de tamaño carta (lo pueden descargar aquí: 1 y 2), que luego de recortar las piezas, me sirvieron de guiá para marcarlas sobre la madera. Después vino el proceso de cortar la madera. En este punto hay que tener mucho cuidado de no arrastrar el exacto para evitar que la madera rompa. Aquí podemos ver las piezas en este proceso.\n\nLas piezas interiores de cuerpo del avión se dibujaron de manera que solo ocuparan un pequeño espacio interior, para hacer que el avión sea hueco por dentro y así, hacerlo más liviano. También coloque un pequeño aro con el clip en la parte interior trasera del avión, para el caso en que desee incorporar una hélice que funcione con una elástica interna. Una vez pegado todo el cuerpo procedí a lijarlo, así como las alas. Hay que tener cuidado en esta etapa para evitar reducir demasiado en los bordes,sin embargo las alas se deben perfilar más delgadas en la parte trasera que en la delantera. Un punto de atención aquí es que se debe tratar de rebajar principalmente por la parte superior.\n\nPara lograr la curvatura de las alas en los bordes de contacto utilice la siguiente técnica (que también vi por aquí): se humedece la madera con jabón para vidrio, hasta que queda flexible. Luego se deja secar con la curvatura que se desea. Esto lo logré con una pelota en la parte inferior del ala y sujetada con una liga elástica fuerte. Después de tener todas la piezas de las alas terminadas, queda pegar. Utilice una pega de las que utilizan en preescolar para evitar el fuerte olor.\n\nAquí podemos ver algunas imágenes de como quedó nuestro avion antes de pintarlo, mientras se secaba la pega:\n\n\n\n\n\n\nPor ultimo viene la etapa del pintado. Escogimos una pintura al frio de color color rojo suave. Tal vez sea mejor idea escoger una pintura acrílica para proteger el avión del agua o la humedad.\n\n\n\n\nJugando con el avión.\nUno de los problemas que se me presentaron fue como evitar que el avión se dañe al caer o como enseñas a Gabriela a lanzarlo. La solución fue amarrarle una cuerda para volarlo en círculos. Le coloque al avión un clip en la base para evitar el roce con la madera cuando aterriza.\n\nAquí, agunas fotos de como utilizamos el cordel para jugar con el avión:\n\n\n\n\n\n\nY aquí algunos videos:\n\n \n\nAquí hay más:\nAquí intento enseñarle como hacer volar el avión con el cordel.\nGabriela jugando con el avión.\nOtro video de Gabriela jugando con el avión.\nEste video marea un poco, intentaba grabar desde la perspectiva del que lo vuela.\n\n\n\n",
    "preview": "gabyprojects/2021-06-13-construccion-de-un-avion-de-madera-de-balsa/../../images/gabyprojects/avion_P1030534.JPG",
    "last_modified": "2024-02-09T00:40:33+00:00",
    "input_file": {}
  },
  {
    "path": "gabyprojects/2021-06-13-elaboracin-de-un-teatrino-casero-para-nuestros-tteres/",
    "title": "Elaboración de un Teatrino casero para nuestros títeres",
    "description": "En el 3er cumpleaños de Gabriela, Yeny tuvo la excelente idea de  incluir unos títeres en los cotillones de los niños. Como ocurre muchas  veces los cálculos sobrestimaron la asistencia de los los niños y nos quedaron unos cuantos títeres de animalitos. De aquí se nos ocurrió la  idea de construir un pequeño teatrino casero ;-)",
    "author": [
      {
        "name": "José R Sosa",
        "url": "https://josersosa.github.io/personalweb/"
      }
    ],
    "date": "2013-11-03",
    "categories": [
      "Carton"
    ],
    "contents": "\n\nContents\nConstrucción del teatrino.\nEl impacto de los títeres\n\nConstrucción del teatrino.\nPara construirlo usé una caja de cartón de un televisor, más o menos así:\n\n\n\n\n\n\nAquí dejo algunas imágenes de como quedo el teatrino:\n\n\n\n\n\n\nEl impacto de los títeres\nEl efecto de de la interacción con títeres es impresionante. A pesar de saber que se trata de un juguete que esta siendo manejado por su papá, Gaby estableció una relación directa y abierta con ellos. La primera vez que usamos el teatrino me pidió que usara cada par de títeres de los que disponíamos para presentarse y mostrarles todos sus juguetes. En una siguiente oportunidad les mostró su uniforme de ballet e incluso les contaba como se sentía y como se había divertido en su clase. Hasta entonces nunca me había percatado del poder de los títeres para que los niños se abran y cuenten sobre sus emociones.\n\n\n\n",
    "preview": "gabyprojects/2021-06-13-elaboracin-de-un-teatrino-casero-para-nuestros-tteres/../../images/gabyprojects/teatrino_IMG00954-20121118-1645.jpg",
    "last_modified": "2024-02-09T00:40:33+00:00",
    "input_file": {}
  }
]
